Table of Contents
 Class PolyLine2D
Namespace
IdeaRS.OpenModel.Geometry2D
Assembly
IdeaRS.OpenModel.dll
Represents a polyline in two-dimensional space.
[OpenModelClass("CI.Geometry2D.PolyLine2D,CI.Geometry2D")]
[DataContract]
public class PolyLine2D : OpenObject
Inheritance
object
OpenObject
PolyLine2D
Inherited Members
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Constructors
 PolyLine2D()
Constructor
public PolyLine2D()
Properties
 Segments
Gets segments of PolyLine2D.
[DataMember]
public List<Segment2D> Segments { get; set; }
Property Value
List<Segment2D>
 StartPoint
Gets or sets the point where the PolyLine2D begins.
[DataMember]
public Point2D StartPoint { get; set; }
Property Value
Point2D
 Edit this page